{
  "__all__": [],
  "SUPPORTED_DRIZZLE_KERNELS": [],
  "CTX_PLANE_BITS": [],
  "_DEPRECATED_ARG": [],
  "Drizzle": {
    "__init__": [
      "self",
      "kernel",
      "fillval",
      "fillval2",
      "out_shape",
      "out_img",
      "out_wht",
      "out_ctx",
      "out_img2",
      "out_dq",
      "exptime",
      "begin_ctx_id",
      "max_ctx_id",
      "disable_ctx"
    ],
    "fillval": [
      "self"
    ],
    "fillval2": [
      "self"
    ],
    "kernel": [
      "self"
    ],
    "ctx_id": [
      "self"
    ],
    "out_img": [
      "self"
    ],
    "out_wht": [
      "self"
    ],
    "out_ctx": [
      "self"
    ],
    "out_img2": [
      "self"
    ],
    "out_dq": [
      "self"
    ],
    "total_exptime": [
      "self"
    ],
    "_alloc_output_arrays": [
      "self",
      "out_shape",
      "max_ctx_id",
      "out_img",
      "out_wht",
      "out_ctx"
    ],
    "_alloc_output_arrays2_init": [
      "self",
      "out_img2"
    ],
    "_alloc_output_arrays2_add": [
      "self",
      "ninputs2"
    ],
    "_increment_ctx_id": [
      "self"
    ],
    "add_image": [
      "self",
      "data",
      "exptime",
      "pixmap",
      "data2",
      "dq",
      "scale",
      "iscale",
      "pixel_scale_ratio",
      "weight_map",
      "wht_scale",
      "pixfrac",
      "in_units",
      "xmin",
      "xmax",
      "ymin",
      "ymax"
    ]
  },
  "blot_image": [
    "data",
    "pixmap",
    "pix_ratio",
    "exptime",
    "output_pixel_shape",
    "out_img",
    "fillval",
    "iscale",
    "interp",
    "sinscl"
  ],
  "_process_fillval": [
    "out_img",
    "fillval"
  ],
  "_DEG2RAD": [],
  "calc_pixmap": [
    "wcs_from",
    "wcs_to",
    "shape",
    "disable_bbox"
  ],
  "estimate_pixel_scale_ratio": [
    "wcs_from",
    "wcs_to",
    "refpix_from",
    "refpix_to"
  ],
  "_estimate_pixel_scale": [
    "wcs",
    "refpix"
  ],
  "decode_context": [
    "context",
    "x",
    "y"
  ],
  "is_blank": [
    "value"
  ],
  "SQ2": [],
  "_is_poly_eq": [
    "p1",
    "p2",
    "rtol",
    "atol"
  ],
  "_coord_mapping": [
    "xin",
    "yin"
  ],
  "_roll_vertices": [
    "polygon",
    "n"
  ],
  "test_invert_pixmap": [],
  "test_invert_small_pixmap": [],
  "test_poly_intersection_with_self": [],
  "test_poly_intersection_shifted": [
    "shift"
  ],
  "test_poly_intersection_shifted_large": [
    "shift"
  ],
  "test_poly_intersection_rotated45": [],
  "test_poly_intersection_flipped_axis": [
    "axis"
  ],
  "test_poly_intersection_reflect_origin": [],
  "test_poly_includes_the_other": [
    "q",
    "small"
  ],
  "test_poly_triangle_common_side": [
    "q"
  ],
  "test_poly_triangle_common_side_lg": [],
  "test_poly_intersection_with_self_extra_vertices": [],
  "test_intersection_case01": [],
  "test_intersection_case02": [],
  "test_cdrizzle": [],
  "test_map_rectangular": [],
  "test_map_to_self": [
    "wcs_type"
  ],
  "test_translated_map": [
    "wcs_type"
  ],
  "test_disable_gwcs_bbox": [],
  "test_estimate_pixel_scale_ratio": [],
  "test_estimate_pixel_scale_no_refpix": [],
  "test_decode_context": [],
  "TEST_DIR": [],
  "DATA_DIR": [],
  "bound_image": [
    "image"
  ],
  "centroid": [
    "image",
    "size",
    "center"
  ],
  "centroid_close": [
    "list_of_centroids",
    "size",
    "point"
  ],
  "centroid_compare": [
    "centroid"
  ],
  "centroid_distances": [
    "image1",
    "image2",
    "amp",
    "size"
  ],
  "centroid_list": [
    "image",
    "amp",
    "size"
  ],
  "centroid_statistics": [
    "title",
    "fname",
    "image1",
    "image2",
    "amp",
    "size"
  ],
  "make_point_image": [
    "shape",
    "point",
    "value"
  ],
  "make_grid_image": [
    "shape",
    "spacing",
    "value"
  ],
  "nrcb5_stars": [],
  "test_drizzle_defaults": [],
  "test_resample_kernel": [
    "tmpdir",
    "kernel",
    "test_image_type",
    "max_diff_atol"
  ],
  "test_resample_kernel_image": [
    "tmpdir",
    "kernel",
    "max_diff_atol"
  ],
  "test_zero_input_weight": [
    "kernel",
    "fc"
  ],
  "test_blot_interpolation": [
    "tmpdir",
    "interpolator",
    "test_image_type"
  ],
  "test_context_planes": [],
  "test_no_context_image": [],
  "test_init_ctx_id": [],
  "test_context_agrees_with_weight": [],
  "test_flux_conservation_nondistorted": [
    "kernel",
    "fc",
    "pixel_scale_ratio"
  ],
  "test_flux_conservation_distorted": [
    "kernel",
    "fc"
  ],
  "test_flux_conservation_distorted_distributed_sources": [
    "nrcb5_stars",
    "kernel",
    "pscale_ratio"
  ],
  "test_drizzle_exptime": [],
  "test_drizzle_unsupported_kernel": [],
  "test_pixmap_shape_matches_image": [],
  "test_drizzle_fillval": [],
  "test_resample_get_shape_from_pixmap": [],
  "test_resample_counts_units": [],
  "test_resample_inconsistent_output": [],
  "test_resample_disable_ctx": [],
  "test_nan_fillval": [
    "fillval"
  ],
  "test_resample_edge_sgarea_bug": [],
  "test_resample_edge_collinear": [],
  "test_drizzle_weights_squared": [
    "kernel",
    "fc"
  ],
  "test_drizzle_weights_squared_pscale": [
    "kernel_fc",
    "pscale",
    "weights"
  ],
  "test_drizzle_weights_squared_bad_inputs": [],
  "test_drizzle_weights_squared_array_shape_mismatch": [],
  "test_drizzle_var_identical_to_nonvar": [
    "kernel_fc",
    "pscale_ratio",
    "kscale_none"
  ],
  "test_drizzle_dq_propagation": [
    "create_out_dq",
    "shift",
    "add_non_dq_image"
  ],
  "test_drizzle_dq_propagation_wrong_shape": [],
  "test_drizzle_dq_propagation_wrong_type": [],
  "test_drizzle_ipscale_same_as_scale": [
    "kernel",
    "pscale_ratio",
    "use_var"
  ],
  "wcs_from_file": [
    "filename",
    "ext",
    "return_data",
    "crpix_shift",
    "wcs_type"
  ],
  "_gwcs_from_hst_fits_wcs": [
    "w"
  ]
}