{
  "__version__": [],
  "get_autoclass_name": [
    "task"
  ],
  "Calibrator": {
    "__init__": [
      "self",
      "calibration_dataset",
      "quantizer",
      "model_path",
      "qconfig",
      "calibration_params",
      "node_exclusion"
    ],
    "fit": [
      "self"
    ]
  },
  "Run": {
    "__init__": [
      "self",
      "run_config"
    ],
    "launch": [
      "self"
    ],
    "_launch_time": [
      "self",
      "trial"
    ],
    "launch_eval": [
      "self"
    ],
    "load_datasets": [
      "self"
    ],
    "get_calibration_dataset": [
      "self"
    ],
    "get_eval_dataset": [
      "self"
    ],
    "finalize": [
      "self"
    ]
  },
  "SEC_TO_NS_SCALE": [],
  "NS_TO_MS_SCALE": [],
  "ns_to_ms": [
    "ns_time"
  ],
  "TimeBenchmark": {
    "__init__": [
      "self",
      "model",
      "batch_size",
      "input_length",
      "model_input_names",
      "warmup_runs",
      "duration"
    ],
    "num_runs": [
      "self"
    ],
    "track": [
      "self"
    ],
    "finalize": [
      "self",
      "duration_ns"
    ],
    "to_dict": [
      "self"
    ],
    "execute": [
      "self"
    ]
  },
  "task_processing_map": [],
  "git_repo_path": [],
  "IGNORE_RESULT": [],
  "OutputChecker": [],
  "CustomOutputChecker": {
    "check_output": [
      "self",
      "want",
      "got",
      "optionflags"
    ]
  },
  "logger": [],
  "OptimumQuantizer": {
    "from_pretrained": [
      "cls",
      "model_or_path",
      "file_name"
    ],
    "quantize": [
      "self",
      "save_dir",
      "file_prefix"
    ]
  },
  "BaseConfig": {
    "CONFIG_NAME": [],
    "FULL_CONFIGURATION_FILE": [],
    "_re_configuration_file": [
      "cls"
    ],
    "save_pretrained": [
      "self",
      "save_directory",
      "push_to_hub"
    ],
    "get_configuration_file": [
      "cls",
      "configuration_files"
    ],
    "get_config_dict": [
      "cls",
      "pretrained_model_name_or_path"
    ],
    "_get_config_dict": [
      "cls",
      "pretrained_model_name_or_path"
    ],
    "from_dict": [
      "cls",
      "config_dict"
    ],
    "to_dict": [
      "self"
    ]
  },
  "FROM_PRETRAINED_START_DOCSTRING": [],
  "PreTrainedModel": {},
  "OptimizedModel": {
    "config_class": [],
    "base_model_prefix": [],
    "config_name": [],
    "__init__": [
      "self",
      "model",
      "config",
      "preprocessors"
    ],
    "__call__": [
      "self"
    ],
    "forward": [
      "self"
    ],
    "save_pretrained": [
      "self",
      "save_directory",
      "push_to_hub"
    ],
    "_save_pretrained": [
      "self",
      "save_directory"
    ],
    "_save_config": [
      "self",
      "save_directory"
    ],
    "push_to_hub": [
      "self",
      "save_directory",
      "repository_id",
      "private",
      "token"
    ],
    "git_config_username_and_email": [
      "self",
      "git_user",
      "git_email"
    ],
    "_load_config": [
      "cls",
      "config_name_or_path",
      "subfolder",
      "revision",
      "force_download",
      "local_files_only",
      "trust_remote_code",
      "cache_dir",
      "token"
    ],
    "_from_pretrained": [
      "cls",
      "model_id",
      "subfolder",
      "revision",
      "force_download",
      "local_files_only",
      "trust_remote_code",
      "cache_dir",
      "token"
    ],
    "_export": [
      "cls",
      "model_id",
      "config",
      "subfolder",
      "revision",
      "force_download",
      "local_files_only",
      "trust_remote_code",
      "cache_dir",
      "token"
    ],
    "from_pretrained": [
      "cls",
      "model_id",
      "config",
      "export",
      "subfolder",
      "revision",
      "force_download",
      "local_files_only",
      "trust_remote_code",
      "cache_dir",
      "token"
    ]
  },
  "load_namespace_modules": [
    "namespace",
    "module"
  ],
  "load_subpackages": [],
  "CommandInfo": {
    "is_subcommand_info": [
      "self"
    ],
    "is_subcommand_info_or_raise": [
      "self"
    ]
  },
  "BaseOptimumCLICommand": {
    "__init__": [
      "self",
      "subparsers",
      "args",
      "command",
      "from_defaults_factory",
      "parser"
    ],
    "subparsers": [
      "self",
      "subparsers"
    ],
    "registered_subcommands": [
      "self"
    ],
    "parse_args": [
      "parser"
    ],
    "register_subcommand": [
      "self",
      "command_info"
    ],
    "run": [
      "self"
    ]
  },
  "RootOptimumCLICommand": {
    "COMMAND": [],
    "__init__": [
      "self",
      "cli_name",
      "usage",
      "args"
    ]
  },
  "OPTIMUM_CLI_ROOT_SUBCOMMANDS": [],
  "_OPTIMUM_CLI_SUBCOMMANDS": [],
  "optimum_cli_subcommand": [
    "parent_command"
  ],
  "resolve_command_to_command_instance": [
    "root",
    "commands"
  ],
  "load_optimum_namespace_cli_commands": [],
  "register_optimum_cli_subcommand": [
    "command_or_command_info",
    "parent_command"
  ],
  "main": [],
  "EnvironmentCommand": {
    "COMMAND": [],
    "format_dict": [
      "d"
    ],
    "run": [
      "self"
    ]
  },
  "ExportCommand": {
    "COMMAND": []
  },
  "_TRANSFORMERS_MIN_VERSION": [],
  "transformers_version": [],
  "_fx_features_available": [],
  "are_fx_features_available": [],
  "check_if_available": [
    "func"
  ],
  "HashableSlice": {
    "__init__": [
      "self",
      "start",
      "stop",
      "step"
    ],
    "__hash__": [
      "self"
    ],
    "__eq__": [
      "self",
      "value"
    ],
    "to_slice": [
      "self"
    ]
  },
  "ParameterSlice": {},
  "ParameterMeta": {},
  "ParallelExecutionCtx": {},
  "Config": {},
  "PassBase": {
    "signature": [
      "cls"
    ],
    "run": [
      "self",
      "graph_module",
      "ctx",
      "config"
    ],
    "__call__": [
      "self",
      "graph_module",
      "ctx",
      "config"
    ]
  },
  "AnalyzeBase": {
    "meta_key": [
      "cls"
    ],
    "get_stored_field_info": [
      "cls",
      "node",
      "field",
      "must_have"
    ],
    "already_executed_per_node": [
      "cls",
      "node"
    ],
    "place_marker_per_node": [
      "self",
      "node",
      "info"
    ],
    "clear_marker_per_node": [
      "self",
      "node"
    ],
    "clean_all": [
      "self",
      "graph_module"
    ]
  },
  "ParallelAxisSolverPass": {
    "trace_back": [
      "self",
      "graph_module",
      "decomp_graph"
    ],
    "run": [
      "self",
      "graph_module",
      "ctx",
      "config"
    ]
  },
  "ParallelLayerAnnotatePass": {
    "run": [
      "self",
      "graph_module",
      "ctx",
      "config"
    ]
  },
  "ParallelLayerReplacePass": {
    "handle_linear": [
      "node",
      "ctx"
    ],
    "handle_embedding": [
      "node",
      "ctx"
    ],
    "handle_cross_entropy": [
      "node",
      "ctx"
    ],
    "handle_hard_coded_axis_param": [
      "node",
      "ctx"
    ],
    "run": [
      "self",
      "graph_module",
      "ctx",
      "config"
    ]
  },
  "InitializeOrLoadWeightsPass": {
    "run": [
      "self",
      "graph_module",
      "ctx",
      "config"
    ]
  },
  "build_parallel_pass_pipeline": [],
  "PassPipeline": {
    "__init__": [
      "self",
      "passes"
    ],
    "__iter__": [
      "self"
    ],
    "append": [
      "self",
      "PASS"
    ],
    "__call__": [
      "self",
      "graph_module",
      "ctx",
      "config"
    ]
  },
  "ensure_divisibility": [
    "numerator",
    "denominator"
  ],
  "is_activation": [
    "node"
  ],
  "is_linear": [
    "node"
  ],
  "is_embedding": [
    "node"
  ],
  "is_shape_consumer": [
    "node"
  ],
  "is_output": [
    "node"
  ],
  "is_shape_generator": [
    "node"
  ],
  "is_cross_entropy": [
    "node"
  ],
  "is_cross_entropy_parallel_compatible": [
    "node"
  ],
  "stable_topological_sort": [
    "graph"
  ],
  "meta_init": [
    "init_fn"
  ],
  "meta_aware_linear_forward": [],
  "meta_aware_embedding_forward": [],
  "MetaAwareMethodsPatcher": {
    "__init__": [
      "self"
    ],
    "_patch": [
      "self",
      "identifier"
    ],
    "_unpatch": [
      "self",
      "identifier"
    ],
    "patch_meta_init": [
      "self"
    ],
    "patch_meta_forward": [
      "self"
    ],
    "unpatch_meta_init": [
      "self"
    ],
    "unpatch_meta_forward": [
      "self"
    ],
    "__enter__": [
      "self"
    ],
    "__exit__": [
      "self",
      "exc_type",
      "exc_value",
      "traceback"
    ]
  },
  "initialize_parameter_meta": [
    "model"
  ],
  "move_model_to_device": [
    "model",
    "device"
  ],
  "temp_dir": [],
  "get_lock": [
    "model_name_or_path",
    "cache_dir"
  ],
  "DisabledTqdm": {
    "__init__": [
      "self"
    ]
  },
  "download_model_from_hf": [
    "model_name_or_path",
    "cache_dir",
    "revision",
    "local_files_only",
    "skip_download_weights"
  ],
  "_original_filename_to_safetensors_filename": [
    "filename"
  ],
  "convert_bin_to_safetensors": [
    "model_name_or_path",
    "cache_dir",
    "weight_files",
    "weight_map"
  ],
  "try_collect_weight_map": [
    "model_name_or_path",
    "cache_dir",
    "folder_path"
  ],
  "parallelize_backend": [
    "graph_module",
    "example_inputs",
    "ctx",
    "config"
  ],
  "parallelize_model": [
    "model",
    "parallel_ctx"
  ],
  "is_leaf_module": [
    "m"
  ],
  "trace_decomp_origin": [],
  "DecompTracer": {
    "__init__": [
      "self",
      "graph"
    ]
  },
  "DecompositionInterpreter": {
    "__init__": [
      "self",
      "module",
      "new_graph",
      "decomposition_table",
      "leaf_function_targets"
    ],
    "placeholder": [
      "self",
      "target",
      "args",
      "kwargs"
    ],
    "call_function": [
      "self",
      "target",
      "args",
      "kwargs"
    ],
    "call_module": [
      "self",
      "target",
      "args",
      "kwargs"
    ],
    "get_attr": [
      "self",
      "target",
      "args",
      "kwargs"
    ],
    "output": [
      "self",
      "target",
      "args",
      "kwargs"
    ],
    "run": [
      "self"
    ]
  },
  "decompose_and_functionalize": [
    "graph_module",
    "decomposition_table",
    "leaf_function_targets"
  ],
  "all_reduce": [
    "group",
    "tensor"
  ],
  "all_gather": [
    "group",
    "tensor",
    "gather_dim"
  ],
  "split": [
    "group",
    "tensor",
    "split_dim"
  ],
  "scatter": [
    "group",
    "tensor",
    "output_tensor",
    "scatter_dim"
  ],
  "DifferentiableIdentity": {
    "forward": [
      "ctx",
      "tensor",
      "group"
    ],
    "backward": [
      "ctx",
      "grad_output"
    ]
  },
  "DifferentiableAllReduceSum": {
    "forward": [
      "ctx",
      "tensor",
      "group"
    ],
    "backward": [
      "ctx",
      "grad_output"
    ]
  },
  "DifferentiableScatter": {
    "forward": [
      "ctx",
      "tensor",
      "group",
      "dim"
    ],
    "backward": [
      "ctx",
      "grad_output"
    ]
  },
  "DifferentiableAllGather": {
    "forward": [
      "ctx",
      "tensor",
      "group",
      "dim"
    ],
    "backward": [
      "ctx",
      "grad_output"
    ]
  },
  "differentiable_all_reduce_sum": [
    "tensor",
    "group"
  ],
  "differentiable_identity": [
    "tensor",
    "group"
  ],
  "differentiable_all_gather": [
    "tensor",
    "group",
    "dim"
  ],
  "differentiable_scatter": [
    "tensor",
    "group",
    "dim"
  ],
  "Registry": {
    "__init__": [
      "self"
    ],
    "register": [
      "self",
      "op_types"
    ],
    "is_supported": [
      "self",
      "op_type"
    ]
  },
  "REGISTRY": [],
  "OpParallelAxisPropagateHandler": {
    "__init__": [
      "self",
      "node",
      "meta_key",
      "config"
    ],
    "extract_axis": [
      "self",
      "arg"
    ],
    "propagate": [
      "self"
    ]
  },
  "UnaryOpParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "BinaryOpParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "ReductionOpParallelAxisPropagateHandler": {
    "extract_dims": [
      "self"
    ],
    "propagate": [
      "self"
    ]
  },
  "ViewLikeOpParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "UnsqueezeParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "SqueezeParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "PermuteParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "SliceParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "ExpandParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "CatParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "PadParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "CopyParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "SpdaAttnParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "FallbackParallelAxisPropagateHandler": {
    "propagate": [
      "self"
    ]
  },
  "_ShardedCrossEntropy": {
    "forward": [
      "ctx",
      "sharded_logits",
      "target",
      "group"
    ],
    "backward": [
      "ctx",
      "grad_output"
    ]
  },
  "sharded_cross_entropy": [
    "sharded_logits",
    "target",
    "process_group"
  ],
  "sharded_cross_entropy_wrapper_fn": [
    "process_group"
  ],
  "VocabParallelCrossEntropyLoss": {
    "__init__": [
      "self",
      "ctx",
      "reduction"
    ],
    "forward": [
      "self",
      "sharded_logits",
      "target"
    ]
  },
  "VocabParallelEmbedding": {
    "__init__": [
      "self",
      "ctx",
      "embedding"
    ],
    "forward": [
      "self",
      "input"
    ]
  },
  "ColumnParallelLinear": {
    "__init__": [
      "self",
      "ctx",
      "linear",
      "gather_output"
    ],
    "forward": [
      "self",
      "input"
    ]
  },
  "RowParallelLinear": {
    "__init__": [
      "self",
      "ctx",
      "linear",
      "input_is_parallel"
    ],
    "forward": [
      "self",
      "input"
    ]
  },
  "_ATTRIBUTES_DOCSTRING": [],
  "_EXAMPLE_DOCSTRING": [],
  "_REVERSIBLE_EXAMPLE_DOCSTRING": [],
  "add_docstring": [
    "add_example"
  ],
  "Transformation": {
    "transform": [
      "self",
      "graph_module"
    ],
    "__call__": [
      "self",
      "graph_module",
      "lint_and_recompile"
    ],
    "signature": [
      "self"
    ],
    "mark_as_transformed": [
      "self",
      "node"
    ],
    "transformed": [
      "self",
      "node"
    ],
    "get_transformed_nodes": [
      "self",
      "graph_module"
    ]
  },
  "ReversibleTransformation": {
    "reverse": [
      "self",
      "graph_module"
    ],
    "__call__": [
      "self",
      "graph_module",
      "lint_and_recompile",
      "reverse"
    ],
    "mark_as_restored": [
      "self",
      "node"
    ]
  },
  "MergeLinears": {
    "preserves_computation": [],
    "_get_bias": [
      "linear"
    ],
    "_get_linear_module_name": [
      "linear_node"
    ],
    "_linear_node_to_module_and_attribute_name": [
      "graph_module",
      "linear_node_target"
    ],
    "_merge_linears": [
      "self",
      "graph_module",
      "input_node",
      "linear_nodes",
      "linears"
    ],
    "_unmerge_linears": [
      "graph_module",
      "merged_linear_node",
      "merged_linear"
    ],
    "transform": [
      "self",
      "graph_module"
    ],
    "reverse": [
      "self",
      "graph_module"
    ]
  },
  "FuseBiasInLinear": {
    "preserves_computation": [],
    "transform": [
      "self",
      "graph_module"
    ],
    "reverse": [
      "self",
      "graph_module"
    ]
  },
  "ChangeTrueDivToMulByInverse": {
    "preserves_computation": [],
    "transform": [
      "self",
      "graph_module"
    ],
    "reverse": [
      "self",
      "graph_module"
    ]
  },
  "FuseBatchNorm2dInConv2d": {
    "preserves_computation": [],
    "transform": [
      "self",
      "graph_module"
    ],
    "fuse": [
      "self",
      "conv2d",
      "bn2d"
    ]
  },
  "FuseBatchNorm1dInLinear": {
    "preserves_computation": [],
    "transform": [
      "self",
      "graph_module"
    ],
    "fuse": [
      "self",
      "linear",
      "bn1d",
      "bn1d_before"
    ]
  },
  "DeepCopy": {
    "preserves_computation": [],
    "transform": [
      "self",
      "graph_module"
    ],
    "reverse": [
      "self",
      "graph_module"
    ]
  },
  "LintAndRecompile": {
    "preserves_computation": [],
    "transform": [
      "self",
      "graph_module"
    ],
    "reverse": [
      "self",
      "graph_module"
    ]
  },
  "compose": [],
  "_gen_constructor_wrapper": [
    "target"
  ],
  "evaluate_perplexity": [
    "model",
    "tokenizer"
  ],
  "get_layers": [
    "module",
    "layers",
    "prefix",
    "name"
  ],
  "get_block_name_with_pattern": [
    "model"
  ],
  "get_preceding_modules": [
    "model",
    "module_name"
  ],
  "get_device": [
    "obj"
  ],
  "get_seqlen": [
    "model"
  ],
  "move_to": [
    "obj",
    "device"
  ],
  "nested_move_to": [
    "v",
    "device"
  ],
  "has_device_more_than_cpu": [],
  "GPTQQuantizer": {
    "__init__": [
      "self",
      "bits",
      "dataset",
      "group_size",
      "damp_percent",
      "desc_act",
      "act_group_aware",
      "sym",
      "true_sequential",
      "model_seqlen",
      "block_name_to_quantize",
      "module_name_preceding_first_block",
      "batch_size",
      "pad_token_id",
      "max_input_length",
      "cache_block_outputs",
      "modules_in_block_to_quantize",
      "format",
      "meta",
      "backend"
    ],
    "select_quant_linear": [
      "self",
      "device_map",
      "pack"
    ],
    "to_dict": [
      "self"
    ],
    "from_dict": [
      "cls",
      "config_dict"
    ],
    "convert_model": [
      "self",
      "model"
    ],
    "get_no_split_module_classes": [
      "self",
      "model"
    ],
    "_replace_by_quant_layers": [
      "self",
      "module",
      "names",
      "name"
    ],
    "quantize_model": [
      "self",
      "model",
      "tokenizer"
    ],
    "post_init_model": [
      "self",
      "model"
    ],
    "pack_model": [
      "self",
      "model",
      "quantizers"
    ],
    "save": [
      "self",
      "model",
      "save_dir",
      "max_shard_size",
      "safe_serialization"
    ]
  },
  "load_quantized_model": [
    "model",
    "save_folder",
    "backend",
    "quant_config_name",
    "state_dict_name",
    "device_map",
    "max_memory",
    "no_split_module_classes",
    "offload_folder",
    "offload_buffers",
    "offload_state_dict",
    "max_input_length"
  ],
  "prepare_dataset": [
    "examples",
    "batch_size",
    "pad_token_id"
  ],
  "collate_data": [
    "blocks",
    "contain_labels",
    "pad_token_id"
  ],
  "get_wikitext2": [
    "tokenizer",
    "seqlen",
    "nsamples",
    "split"
  ],
  "get_c4": [
    "tokenizer",
    "seqlen",
    "nsamples",
    "split"
  ],
  "get_c4_new": [
    "tokenizer",
    "seqlen",
    "nsamples",
    "split"
  ],
  "get_ptb": [
    "tokenizer",
    "seqlen",
    "nsamples",
    "split"
  ],
  "get_ptb_new": [
    "tokenizer",
    "seqlen",
    "nsamples",
    "split"
  ],
  "get_dataset": [
    "dataset_name",
    "tokenizer",
    "nsamples",
    "seqlen",
    "seed",
    "split"
  ],
  "SEQLEN_KEYS_TRANSFORMERS": [],
  "BLOCK_PATTERNS": [],
  "GPTQ_CONFIG": [],
  "validate_file_exists": [
    "model_name_or_path",
    "filename",
    "subfolder",
    "revision",
    "token"
  ],
  "find_files_matching_pattern": [
    "model_name_or_path",
    "pattern",
    "glob_pattern",
    "subfolder",
    "token",
    "revision"
  ],
  "NormalizedConfig": {
    "__init__": [
      "self",
      "config",
      "allow_new"
    ],
    "with_args": [
      "cls",
      "allow_new"
    ],
    "__getattr__": [
      "self",
      "attr_name"
    ],
    "has_attribute": [
      "self",
      "attr_name"
    ]
  },
  "NormalizedTimeSeriesForecastingConfig": {
    "NUM_INPUT_CHANNELS": [],
    "CONTEXT_LENGTH": []
  },
  "NormalizedTextConfig": {
    "VOCAB_SIZE": [],
    "HIDDEN_SIZE": [],
    "NUM_LAYERS": [],
    "NUM_ATTENTION_HEADS": [],
    "EOS_TOKEN_ID": []
  },
  "NormalizedTextConfigWithGQA": {
    "NUM_KEY_VALUE_HEADS": []
  },
  "NormalizedSeq2SeqConfig": {
    "ENCODER_NUM_LAYERS": [],
    "DECODER_NUM_LAYERS": [],
    "ENCODER_NUM_ATTENTION_HEADS": [],
    "DECODER_NUM_ATTENTION_HEADS": []
  },
  "NormalizedVisionConfig": {
    "IMAGE_SIZE": [],
    "NUM_CHANNELS": [],
    "INPUT_SIZE": []
  },
  "NormalizedSegformerConfig": {
    "NUM_ATTENTION_HEADS": [],
    "HIDDEN_SIZE": [],
    "__getattr__": [
      "self",
      "attr_name"
    ]
  },
  "NormalizedTextAndVisionConfig": {
    "TEXT_CONFIG": [],
    "VISION_CONFIG": [],
    "__getattr__": [
      "self",
      "attr_name"
    ]
  },
  "Pix2StructNormalizedTextConfig": [],
  "NormalizedEncoderDecoderConfig": {
    "ENCODER_NORMALIZED_CONFIG_CLASS": [],
    "DECODER_NORMALIZED_CONFIG_CLASS": [],
    "__getattr__": [
      "self",
      "attr_name"
    ]
  },
  "BartLikeNormalizedTextConfig": [],
  "GPT2LikeNormalizedTextConfig": [],
  "T5LikeNormalizedTextConfig": [],
  "MPTNormalizedTextConfig": [],
  "GPTBigCodeNormalizedTextConfig": [],
  "WhisperLikeNormalizedTextConfig": [],
  "TrOCRLikeNormalizedTextConfig": [],
  "SpeechToTextLikeNormalizedTextConfig": [],
  "BloomNormalizedTextConfig": [],
  "DistilBertNormalizedTextConfig": [],
  "GPTNeoNormalizedTextConfig": [],
  "NormalizedConfigManager": {
    "_conf": [],
    "check_supported_model": [
      "cls",
      "model_type"
    ],
    "get_normalized_config_class": [
      "cls",
      "model_type"
    ]
  },
  "maybe_load_preprocessors": [
    "src_name_or_path",
    "subfolder",
    "trust_remote_code"
  ],
  "maybe_save_preprocessors": [
    "src_name_or_path",
    "dest_dir",
    "src_subfolder",
    "trust_remote_code"
  ],
  "APIFeaturesManager": {
    "_SUPPORTED_TASKS": [],
    "check_supported_model_task_pair": [
      "model_type",
      "task"
    ],
    "check_supported_task": [
      "task"
    ]
  },
  "Frameworks": {
    "onnxruntime": []
  },
  "CalibrationMethods": {
    "minmax": [],
    "percentile": [],
    "entropy": []
  },
  "QuantizationApproach": {
    "static": [],
    "dynamic": []
  },
  "cpu_info_command": [],
  "Calibration": {},
  "FrameworkArgs": {
    "__post_init__": [
      "self"
    ]
  },
  "DatasetArgs": {},
  "TaskArgs": {},
  "BenchmarkTimeArgs": {},
  "_RunBase": {},
  "_RunDefaults": {},
  "_RunConfigBase": {},
  "_RunConfigDefaults": {},
  "RunConfig": {
    "__post_init__": [
      "self"
    ]
  },
  "TORCH_MINIMUM_VERSION": [],
  "TRANSFORMERS_MINIMUM_VERSION": [],
  "DIFFUSERS_MINIMUM_VERSION": [],
  "AUTOGPTQ_MINIMUM_VERSION": [],
  "GPTQMODEL_MINIMUM_VERSION": [],
  "ORT_QUANTIZE_MINIMUM_VERSION": [],
  "STR_OPERATION_TO_FUNC": [],
  "_is_package_available": [
    "pkg_name",
    "return_version",
    "pkg_distributions"
  ],
  "_timm_available": [],
  "_onnx_available": [],
  "_datasets_available": [],
  "_tensorrt_available": [],
  "_pydantic_available": [],
  "_openvino_available": [],
  "_gptqmodel_available": [],
  "_accelerate_available": [],
  "_optimum_onnx_available": [],
  "_optimum_intel_available": [],
  "_ipex_available": [],
  "_sentence_transformers_available": [],
  "_onnxruntime_available": [],
  "_onnxslim_available": [],
  "compare_versions": [
    "library_or_version",
    "operation",
    "requirement_version"
  ],
  "is_transformers_version": [
    "operation",
    "reference_version"
  ],
  "is_diffusers_version": [
    "operation",
    "reference_version"
  ],
  "is_torch_version": [
    "operation",
    "reference_version"
  ],
  "_is_torch_onnx_support_available": [],
  "is_torch_onnx_support_available": [],
  "is_onnx_available": [],
  "is_onnxruntime_available": [],
  "is_pydantic_available": [],
  "is_accelerate_available": [],
  "is_diffusers_available": [],
  "is_timm_available": [],
  "is_sentence_transformers_available": [],
  "is_datasets_available": [],
  "is_transformers_available": [],
  "is_tensorrt_available": [],
  "is_torch_available": [],
  "is_gptqmodel_available": [],
  "is_onnxslim_available": [],
  "is_ipex_available": [],
  "is_openvino_available": [],
  "is_optimum_onnx_available": [],
  "is_optimum_intel_available": [],
  "require_numpy_strictly_lower": [
    "package_version",
    "message"
  ],
  "DIFFUSERS_IMPORT_ERROR": [],
  "TRANSFORMERS_IMPORT_ERROR": [],
  "DATASETS_IMPORT_ERROR": [],
  "BACKENDS_MAPPING": [],
  "requires_backends": [
    "obj",
    "backends"
  ],
  "DummyObject": {
    "__getattr__": [
      "cls",
      "key"
    ]
  },
  "USER": [],
  "flatten_dict": [
    "dictionary"
  ],
  "require_accelerate": [
    "test_case"
  ],
  "require_gptqmodel": [
    "test_case"
  ],
  "require_torch_gpu": [
    "test_case"
  ],
  "require_ort_rocm": [
    "test_case"
  ],
  "require_hf_token": [
    "test_case"
  ],
  "require_sigopt_token_and_project": [
    "test_case"
  ],
  "is_ort_training_available": [],
  "require_ort_training": [
    "test_case"
  ],
  "require_diffusers": [
    "test_case"
  ],
  "require_timm": [
    "test_case"
  ],
  "require_sentence_transformers": [
    "test_case"
  ],
  "require_datasets": [
    "test_case"
  ],
  "grid_parameters": [
    "parameters",
    "yield_dict",
    "add_test_name",
    "filter_params_func"
  ],
  "remove_directory": [
    "dirpath"
  ],
  "_lock": [],
  "log_levels": [],
  "_default_log_level": [],
  "_get_default_logging_level": [],
  "_get_library_name": [],
  "_get_library_root_logger": [],
  "_configure_library_root_logger": [],
  "_reset_library_root_logger": [],
  "get_log_levels_dict": [],
  "get_logger": [
    "name"
  ],
  "get_verbosity": [],
  "set_verbosity": [
    "verbosity"
  ],
  "set_verbosity_info": [],
  "set_verbosity_warning": [],
  "set_verbosity_debug": [],
  "set_verbosity_error": [],
  "disable_default_handler": [],
  "enable_default_handler": [],
  "add_handler": [
    "handler"
  ],
  "remove_handler": [
    "handler"
  ],
  "disable_propagation": [],
  "enable_propagation": [],
  "enable_explicit_format": [],
  "reset_format": [],
  "warn_once": [
    "logger",
    "msg"
  ],
  "check_framework_is_available": [
    "func"
  ],
  "DEFAULT_DUMMY_SHAPES": [],
  "DTYPE_MAPPER": {
    "np": [
      "cls",
      "dtype"
    ],
    "pt": [
      "cls",
      "dtype"
    ]
  },
  "DummyInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "supports_input": [
      "self",
      "input_name"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ],
    "random_int_tensor": [
      "shape",
      "max_value",
      "min_value",
      "framework",
      "dtype"
    ],
    "random_mask_tensor": [
      "shape",
      "padding_side",
      "framework",
      "dtype"
    ],
    "random_float_tensor": [
      "shape",
      "min_value",
      "max_value",
      "framework",
      "dtype"
    ],
    "constant_tensor": [
      "shape",
      "value",
      "dtype",
      "framework"
    ],
    "_infer_framework_from_input": [
      "input_"
    ],
    "concat_inputs": [
      "cls",
      "inputs",
      "dim"
    ],
    "pad_input_on_dim": [
      "cls",
      "input_",
      "dim",
      "desired_length",
      "padding_length",
      "value",
      "dtype"
    ]
  },
  "DummyTextInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "num_choices",
      "random_batch_size_range",
      "random_sequence_length_range",
      "random_num_choices_range",
      "padding_side"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "LongformerDummyTextInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyXPathSeqInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "num_choices",
      "random_batch_size_range",
      "random_sequence_length_range",
      "random_num_choices_range",
      "padding_side"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyDecoderTextInputGenerator": {
    "SUPPORTED_INPUT_NAMES": []
  },
  "DummyDecisionTransformerInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummySeq2SeqDecoderTextInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "num_choices",
      "random_batch_size_range",
      "random_sequence_length_range",
      "random_num_choices_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyPastKeyValuesGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummySeq2SeqPastKeyValuesGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "encoder_sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyBboxInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyVisionInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "num_channels",
      "width",
      "height",
      "visual_seq_length"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyAudioInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "feature_size",
      "nb_max_frames",
      "audio_sequence_length"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyTimestepInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "random_batch_size_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyLabelsGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "random_batch_size_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyPointsGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "point_batch_size",
      "nb_points_per_image"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyVisionEmbeddingsGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "image_embedding_size",
      "output_channels"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyPix2StructInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "preprocessors",
      "batch_size",
      "num_channels"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "GPTBigCodeDummyPastKeyValuesGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "BloomDummyPastKeyValuesGenerator": {
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DeepSeekV3DummyPastKeyValuesGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "MultiQueryPastKeyValuesGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "FalconDummyPastKeyValuesGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "MistralDummyPastKeyValuesGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "GemmaDummyPastKeyValuesGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummySpeechT5InputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "sequence_length"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyVisionEncoderDecoderPastKeyValuesGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "encoder_sequence_length",
      "random_batch_size_range",
      "random_sequence_length_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyCodegenDecoderTextInputGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "num_choices",
      "random_batch_size_range",
      "random_sequence_length_range",
      "random_num_choices_range"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyEncodecInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "sequence_length",
      "batch_size"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyIntGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyTransformerTimestepInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyTransformerVisionInputGenerator": {
    "SUPPORTED_INPUT_NAMES": []
  },
  "DummyTransformerTextInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyFluxTransformerVisionInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyFluxTransformerTextInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "DummyPatchTSTInputGenerator": {
    "SUPPORTED_INPUT_NAMES": [],
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "MCTCTDummyAudioInputGenerator": {
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "Dinov2DummyInputGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "num_channels",
      "width",
      "height"
    ]
  },
  "DummyVisionStaticInputGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "num_channels",
      "width",
      "height"
    ]
  },
  "PerceiverDummyInputGenerator": {},
  "VitPoseDummyInputGenerator": {},
  "T5DummySeq2SeqPastKeyValuesGenerator": {
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "BartDummyTextInputGenerator": {
    "__init__": [
      "self",
      "task",
      "normalized_config",
      "batch_size",
      "sequence_length",
      "num_choices",
      "random_batch_size_range",
      "random_sequence_length_range",
      "random_num_choices_range",
      "force_eos_token_id_presence"
    ],
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "ASTDummyAudioInputGenerator": {
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "Speech2TextDummyAudioInputGenerator": {
    "generate": [
      "self",
      "input_name",
      "framework",
      "int_dtype",
      "float_dtype"
    ]
  },
  "MODEL_TO_PATCH_FOR_PAST": [],
  "recurse_getattr": [
    "obj",
    "attr"
  ],
  "recurse_setattr": [
    "module",
    "name",
    "value"
  ],
  "CONFIG_NAME": [],
  "DIFFUSION_MODEL_UNET_SUBFOLDER": [],
  "DIFFUSION_MODEL_TRANSFORMER_SUBFOLDER": [],
  "DIFFUSION_MODEL_VAE_DECODER_SUBFOLDER": [],
  "DIFFUSION_MODEL_VAE_ENCODER_SUBFOLDER": [],
  "DIFFUSION_MODEL_TEXT_ENCODER_SUBFOLDER": [],
  "DIFFUSION_MODEL_TEXT_ENCODER_2_SUBFOLDER": [],
  "DIFFUSION_MODEL_TEXT_ENCODER_3_SUBFOLDER": [],
  "DIFFUSION_PIPELINE_CONFIG_FILE_NAME": [],
  "DIFFUSION_MODEL_CONFIG_FILE_NAME": [],
  "ONNX_WEIGHTS_NAME": [],
  "ALL_TASKS": [],
  "generate_doc_dataclass": [
    "cls"
  ],
  "add_dynamic_docstring": [],
  "Preprocessor": [],
  "TaskProcessor": {
    "__init__": [
      "self",
      "config",
      "preprocessor",
      "preprocessor_kwargs"
    ],
    "create_defaults_and_kwargs_from_preprocessor_kwargs": [
      "self",
      "preprocessor_kwargs"
    ],
    "dataset_processing_func": [
      "self",
      "example",
      "data_keys",
      "ref_keys"
    ],
    "create_dataset_processing_func": [
      "self",
      "data_keys",
      "ref_keys"
    ],
    "prepare_dataset": [
      "self",
      "dataset",
      "data_keys",
      "ref_keys",
      "split"
    ],
    "try_to_guess_data_keys": [
      "self",
      "column_names"
    ],
    "try_to_guess_ref_keys": [
      "self",
      "column_names"
    ],
    "load_dataset": [
      "self",
      "path",
      "data_keys",
      "ref_keys",
      "only_keep_necessary_columns",
      "load_smallest_split",
      "num_samples",
      "shuffle",
      "download_config"
    ],
    "load_default_dataset": [
      "self",
      "only_keep_necessary_columns",
      "load_smallest_split",
      "num_samples",
      "shuffle"
    ]
  },
  "TokenClassificationProcessing": {
    "ACCEPTED_PREPROCESSOR_CLASSES": [],
    "DEFAULT_DATASET_ARGS": [],
    "DEFAULT_DATASET_DATA_KEYS": [],
    "ALLOWED_DATA_KEY_NAMES": [],
    "DEFAULT_REF_KEYS": [],
    "create_defaults_and_kwargs_from_preprocessor_kwargs": [
      "self",
      "preprocessor_kwargs"
    ],
    "dataset_processing_func": [
      "self",
      "example",
      "data_keys",
      "ref_keys"
    ],
    "try_to_guess_data_keys": [
      "self",
      "column_names"
    ],
    "try_to_guess_ref_keys": [
      "self",
      "column_names"
    ],
    "load_dataset": [
      "self",
      "path",
      "data_keys",
      "ref_keys",
      "only_keep_necessary_columns",
      "load_smallest_split",
      "num_samples",
      "shuffle"
    ]
  },
  "TaskProcessorsManager": {
    "_TASK_TO_DATASET_PROCESSING_CLASS": [],
    "get_task_processor_class_for_task": [
      "cls",
      "task"
    ],
    "for_task": [
      "cls",
      "task"
    ]
  },
  "TextClassificationProcessing": {
    "ACCEPTED_PREPROCESSOR_CLASSES": [],
    "DEFAULT_DATASET_ARGS": [],
    "DEFAULT_DATASET_DATA_KEYS": [],
    "ALLOWED_DATA_KEY_NAMES": [],
    "DEFAULT_REF_KEYS": [],
    "create_defaults_and_kwargs_from_preprocessor_kwargs": [
      "self",
      "preprocessor_kwargs"
    ],
    "dataset_processing_func": [
      "self",
      "example",
      "data_keys",
      "ref_keys"
    ],
    "try_to_guess_data_keys": [
      "self",
      "column_names"
    ],
    "try_to_guess_ref_keys": [
      "self",
      "column_names"
    ],
    "load_dataset": [
      "self",
      "path",
      "data_keys",
      "ref_keys",
      "only_keep_necessary_columns",
      "load_smallest_split",
      "num_samples",
      "shuffle"
    ]
  },
  "QuestionAnsweringProcessing": {
    "ACCEPTED_PREPROCESSOR_CLASSES": [],
    "DEFAULT_DATASET_ARGS": [],
    "DEFAULT_DATASET_DATA_KEYS": [],
    "ALLOWED_DATA_KEY_NAMES": [],
    "DEFAULT_REF_KEYS": [],
    "create_defaults_and_kwargs_from_preprocessor_kwargs": [
      "self",
      "preprocessor_kwargs"
    ],
    "dataset_processing_func": [
      "self",
      "example",
      "data_keys",
      "ref_keys"
    ],
    "try_to_guess_data_keys": [
      "self",
      "column_names"
    ],
    "try_to_guess_ref_keys": [
      "self",
      "column_names"
    ]
  },
  "ImageClassificationProcessing": {
    "ACCEPTED_PREPROCESSOR_CLASSES": [],
    "DEFAULT_DATASET_ARGS": [],
    "DEFAULT_DATASET_DATA_KEYS": [],
    "ALLOWED_DATA_KEY_NAMES": [],
    "DEFAULT_REF_KEYS": [],
    "__init__": [
      "self",
      "config",
      "preprocessor",
      "preprocessor_kwargs"
    ],
    "dataset_processing_func": [
      "self",
      "example",
      "data_keys",
      "ref_keys"
    ],
    "try_to_guess_data_keys": [
      "self",
      "column_names"
    ],
    "try_to_guess_ref_keys": [
      "self",
      "column_names"
    ],
    "load_dataset": [
      "self",
      "path",
      "data_keys",
      "ref_keys",
      "only_keep_necessary_columns",
      "load_smallest_split",
      "num_samples",
      "shuffle"
    ]
  },
  "ExportConfigConstructor": [],
  "make_backend_config_constructor_for_task": [
    "config_cls",
    "task"
  ],
  "get_diffusers_tasks_to_model_mapping": [],
  "get_transformers_tasks_to_model_mapping": [
    "tasks_to_model_loader"
  ],
  "TasksManager": {
    "_TRANSFORMERS_TASKS_TO_MODEL_LOADERS": [],
    "_DIFFUSERS_TASKS_TO_MODEL_LOADERS": [],
    "_TIMM_TASKS_TO_MODEL_LOADERS": [],
    "_LIBRARY_TO_TASKS_TO_MODEL_LOADER_MAP": [],
    "_TRANSFORMERS_TASKS_TO_MODEL_MAPPINGS": [],
    "_DIFFUSERS_TASKS_TO_MODEL_MAPPINGS": [],
    "_SYNONYM_TASK_MAP": [],
    "_CUSTOM_CLASSES": [],
    "_ENCODER_DECODER_TASKS": [],
    "_MODEL_TYPE_FOR_DEFAULT_CONFIG": [],
    "_SUPPORTED_MODEL_TYPE": [],
    "_TIMM_SUPPORTED_MODEL_TYPE": [],
    "_DIFFUSERS_SUPPORTED_MODEL_TYPE": [],
    "_SENTENCE_TRANSFORMERS_SUPPORTED_MODEL_TYPE": [],
    "_LIBRARY_TO_SUPPORTED_MODEL_TYPES": [],
    "_UNSUPPORTED_CLI_MODEL_TYPE": [],
    "_SUPPORTED_CLI_MODEL_TYPE": [],
    "create_register": [
      "cls",
      "backend",
      "overwrite_existing"
    ],
    "get_supported_tasks_for_model_type": [
      "model_type",
      "exporter",
      "model_name",
      "library_name"
    ],
    "get_supported_model_type_for_task": [
      "task",
      "exporter"
    ],
    "synonyms_for_task": [
      "task"
    ],
    "map_from_synonym": [
      "task"
    ],
    "_validate_framework_choice": [
      "framework"
    ],
    "get_model_class_for_task": [
      "task",
      "framework",
      "model_type",
      "model_class_name",
      "library"
    ],
    "get_model_files": [
      "model_name_or_path",
      "subfolder",
      "cache_dir",
      "token",
      "revision"
    ],
    "determine_framework": [
      "model_name_or_path",
      "subfolder",
      "revision",
      "cache_dir",
      "token"
    ],
    "_infer_task_from_model_or_model_class": [
      "cls",
      "model",
      "model_class"
    ],
    "_infer_task_from_model_name_or_path": [
      "cls",
      "model_name_or_path",
      "subfolder",
      "revision",
      "cache_dir",
      "token",
      "library_name"
    ],
    "infer_task_from_model": [
      "cls",
      "model",
      "subfolder",
      "revision",
      "cache_dir",
      "token",
      "library_name"
    ],
    "_infer_library_from_model_or_model_class": [
      "cls",
      "model",
      "model_class"
    ],
    "_infer_library_from_model_name_or_path": [
      "cls",
      "model_name_or_path",
      "subfolder",
      "revision",
      "cache_dir",
      "token"
    ],
    "infer_library_from_model": [
      "cls",
      "model",
      "subfolder",
      "revision",
      "cache_dir",
      "token"
    ],
    "standardize_model_attributes": [
      "cls",
      "model",
      "library_name"
    ],
    "get_all_tasks": [],
    "get_model_from_task": [
      "task",
      "model_name_or_path",
      "subfolder",
      "revision",
      "cache_dir",
      "token",
      "framework",
      "torch_dtype",
      "device",
      "library_name"
    ],
    "get_exporter_config_constructor": [
      "exporter",
      "model",
      "task",
      "model_type",
      "model_name",
      "exporter_config_kwargs",
      "library_name"
    ]
  },
  "GENERATE_DUMMY_DOCSTRING": [],
  "ExportConfig": {
    "__init_subclass__": [
      "cls"
    ]
  },
  "ExporterConfig": {
    "NORMALIZED_CONFIG_CLASS": [],
    "DUMMY_INPUT_GENERATOR_CLASSES": [],
    "MIN_TORCH_VERSION": [],
    "MIN_TRANSFORMERS_VERSION": [],
    "_TASK_TO_COMMON_OUTPUTS": [],
    "__init__": [
      "self",
      "config",
      "task",
      "int_dtype",
      "float_dtype"
    ],
    "_create_dummy_input_generator_classes": [
      "self"
    ],
    "inputs": [
      "self"
    ],
    "outputs": [
      "self"
    ],
    "values_override": [
      "self"
    ],
    "is_transformers_support_available": [
      "self"
    ],
    "is_torch_support_available": [
      "self"
    ],
    "generate_dummy_inputs": [
      "self",
      "framework"
    ]
  },
  "ENCODER_NAME": [],
  "DECODER_NAME": [],
  "DECODER_WITH_PAST_NAME": [],
  "DECODER_MERGED_NAME": [],
  "_DIFFUSERS_CLASS_NAME_TO_SUBMODEL_TYPE": [],
  "_get_diffusers_submodel_type": [
    "submodel"
  ],
  "_get_submodels_for_export_diffusion": [
    "pipeline"
  ],
  "_get_submodels_for_export_decoder": [
    "model",
    "use_past"
  ],
  "_get_submodels_for_export_encoder_decoder": [
    "model",
    "use_past"
  ],
  "get_encoder_decoder_models_for_export": [
    "model",
    "config"
  ],
  "get_decoder_models_for_export": [
    "model",
    "config"
  ],
  "get_diffusion_models_for_export": [
    "pipeline",
    "int_dtype",
    "float_dtype",
    "exporter"
  ],
  "get_musicgen_models_for_export": [
    "model",
    "config"
  ],
  "_get_submodels_for_export_sam": [
    "model",
    "variant"
  ],
  "get_sam_models_for_export": [
    "model",
    "config"
  ],
  "get_speecht5_models_for_export": [
    "model",
    "config",
    "model_kwargs"
  ],
  "override_diffusers_2_0_attn_processors": [
    "model"
  ],
  "_get_submodels_and_export_configs": [
    "model",
    "task",
    "monolith",
    "custom_export_configs",
    "custom_architecture",
    "_variant",
    "library_name",
    "int_dtype",
    "float_dtype",
    "fn_get_submodels",
    "preprocessors",
    "model_kwargs",
    "exporter"
  ],
  "check_dummy_inputs_are_allowed": [
    "model",
    "dummy_input_names"
  ],
  "DisableCompileContextManager": {
    "__init__": [
      "self"
    ],
    "__enter__": [
